In [1]:
import numpy as np

In [2]:
import pandas as pd
from pandas import Series, DataFrame

In [4]:
df = DataFrame({'key':['x','y','z','x','y'],'data_set_1':np.arange(5)})

In [5]:
df

   data_set_1 key
0           0   x
1           1   y
2           2   z
3           3   x
4           4   y

In [9]:
df2 = DataFrame({'key':['x','s','y'],'data_set_2':np.arange(3)})

In [10]:
df2

   data_set_2 key
0           0   x
1           1   s
2           2   y

In [11]:
pd.merge(df,df2)

   data_set_1 key  data_set_2
0           0   x           0
1           3   x           0
2           1   y           2
3           4   y           2

In [12]:
pd.merge(df,df2,on='key')

   data_set_1 key  data_set_2
0           0   x           0
1           3   x           0
2           1   y           2
3           4   y           2

In [13]:
pd.merge(df,df2,on='key',how='left')

   data_set_1 key  data_set_2
0           0   x         0.0
1           1   y         2.0
2           2   z         NaN
3           3   x         0.0
4           4   y         2.0

In [14]:
pd.merge(df,df2,on='key',how='right')

   data_set_1 key  data_set_2
0         0.0   x           0
1         3.0   x           0
2         1.0   y           2
3         4.0   y           2
4         NaN   s           1

In [15]:
pd.merge(df,df2,on='key',how='outer')

   data_set_1 key  data_set_2
0         0.0   x         0.0
1         3.0   x         0.0
2         1.0   y         2.0
3         4.0   y         2.0
4         2.0   z         NaN
5         NaN   s         1.0

In [16]:
df3 = DataFrame({'key':['x','x','x','y','y','z'],'data_set_3':range(6)})

In [17]:
df4 = DataFrame({'key':['y','z','y'],'data_set_4':range(3)})

In [18]:
df3

   data_set_3 key
0           0   x
1           1   x
2           2   x
3           3   y
4           4   y
5           5   z

In [19]:
df4

   data_set_4 key
0           0   y
1           1   z
2           2   y

In [20]:
pd.merge(df3,df4)

   data_set_3 key  data_set_4
0           3   y           0
1           3   y           2
2           4   y           0
3           4   y           2
4           5   z           1

In [21]:
df5 = DataFrame({'key1':['sf','tx','la'],
                'key2':['one','two','three'],
                'left_data':[10,20,30]})

In [22]:
df5

  key1   key2  left_data
0   sf    one         10
1   tx    two         20
2   la  three         30

In [24]:
df6 = DataFrame({'key1':['la','la','tx','tx'],'key2':['one','two','one','two'],'right_data':[40,50,60,70]})

In [25]:
df6

  key1 key2  right_data
0   la  one          40
1   la  two          50
2   tx  one          60
3   tx  two          70

In [26]:
pd.merge(df5,df6,on=['key1','key2'],how='outer')

  key1   key2  left_data  right_data
0   sf    one       10.0         NaN
1   tx    two       20.0        70.0
2   la  three       30.0         NaN
3   la    one        NaN        40.0
4   la    two        NaN        50.0
5   tx    one        NaN        60.0

In [28]:
pd.merge(df5,df6,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   tx    two         20    one          60
1   tx    two         20    two          70
2   la  three         30    one          40
3   la  three         30    two          50

In [29]:
pd.merge(df5,df6,on='key1',suffixes=('_lefty','_ri'))

  key1 key2_lefty  left_data key2_ri  right_data
0   tx        two         20     one          60
1   tx        two         20     two          70
2   la      three         30     one          40
3   la      three         30     two          50